app/Controllers/CiudadanosController.php

SELECT *
FROM `ciudadanos`
---
  public function index(): string
  {
    $ciudadanos = new CiudadanosModel();
    $datos['datos'] = $ciudadanos->findAll();

SELECT *
FROM `ciudadanos`
WHERE `dpi` = '1007928191909'
 LIMIT 1
---
  public function buscarCiudadano($id = null){
    $ciudadanosModel = new CiudadanosModel();
    $datos ['datos'] = $ciudadanosModel -> where('dpi',$id)->first();